# Lab 3: Data preprocessing

## Part A: Python Pandas

### Topic 1: Pandas Series

In [1]:
import numpy as np
import pandas as pd

Create a Series from a list = [9, 18, 27, 36, 45, 54, 63, 72, 81].

In [2]:
x = [9, 18, 27, 36, 45, 54, 63, 72, 81]

In [3]:
s = pd.Series(x)

Print the output of the list and print the output from Series

In [4]:
x

[9, 18, 27, 36, 45, 54, 63, 72, 81]

In [5]:
s

0     9
1    18
2    27
3    36
4    45
5    54
6    63
7    72
8    81
dtype: int64

Print the 5th index from Series

In [6]:
s[4]

45

Create your own index labels using alphabetical order (from a until i)

In [8]:
s2 = pd.Series(x, index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i'])

Print the output of new Series

In [9]:
s2

a     9
b    18
c    27
d    36
e    45
f    54
g    63
h    72
i    81
dtype: int64

Print the label from 'h'.

In [10]:
s2['h']

72

In [12]:
s2.sort_values(ascending = False, inplace = True)

In [13]:
s2

i    81
h    72
g    63
f    54
e    45
d    36
c    27
b    18
a     9
dtype: int64

Sum

In [14]:
s2.sum()

405

Product

In [15]:
s2.product()

140587147048320

Average

In [16]:
s2.mean()

45.0

Median

In [17]:
s2.median()

45.0

Minimum

In [18]:
s2.min()

9

Maximum

In [19]:
s2.max()

81

Simplify the calculations by using aggregation function agg().

In [30]:
s2.agg(['sum','mean','median','max','min'])

sum       405.0
mean       45.0
median     45.0
max        81.0
min         9.0
dtype: float64

### Topic 2: Pandas Data Frame

In [31]:
df = pd.DataFrame(s2)

In [32]:
df

    0
i  81
h  72
g  63
f  54
e  45
d  36
c  27
b  18
a   9

Insert a new column called ‘First Name’ into the Data Frame with the following values:
[‘Adam’, ‘Jack’, ‘James’, ‘Tony’, ‘Sam’, ‘Tiffany’, ‘Billy’, ‘Tom’, ‘Chris’]

In [33]:
df['First Name'] = ['Adam', 'Jack', 'James', 'Tony', 'Sam', 'Tiffany', 'Billy', 'Tom', 'Chris']

In [34]:
df

    0 First Name
i  81       Adam
h  72       Jack
g  63      James
f  54       Tony
e  45        Sam
d  36    Tiffany
c  27      Billy
b  18        Tom
a   9      Chris

Locate row 'c' in the data frame

In [42]:
df.loc['c']

0                27
First Name    Billy
Name: c, dtype: object

## Part B: Case Study based on Dataset

### Topic 1: SF Salaries Exercise

Read Salaries.csv as a Data Frame called sal.

In [43]:
sal = pd.read_csv('Salaries.csv')

Check the head of the Data Frame

In [44]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

Use the .info() method to find out how many entries there are

In [45]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

Find the average base pay

In [46]:
sal['BasePay'].mean()

66325.4488404877

Find the highest amount of overtime pay in the dataset

In [47]:
sal['OvertimePay'].max()

245131.88

What is the job title of JOSEPH DRISCOLL ? 
- Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll)

In [52]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

How much does JOSEPH DRISCOLL make (including benefits)?

In [53]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

What is the name of highest paid person (including benefits)?

In [58]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?

In [59]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].min()]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

In [60]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

Joe Lopez has negative salary.

What was the average base pay of all employees per year from 2011 to 2014 ?

In [64]:
sal.groupby('Year').mean()['BasePay']

C:\Users\kuan.yikjunn\AppData\Local\Temp\ipykernel_14084\3145117890.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

How many unique job titles are there?

In [66]:
sal['JobTitle'].nunique()

2159

What are the top 5 most common jobs?

In [68]:
sal['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?)

In [69]:
sum(sal[sal['Year']==2013]['JobTitle'].value_counts() == 1)

202

How many people have the word Chief in their job title?

In [70]:
def chief_string(title):
    if 'chief' in title.lower():
        return True
    else:
        return False

In [71]:
sum(sal['JobTitle'].apply(lambda x: chief_string(x)))

627

Is there a correlation between length of the Job Title string and Salary?

In [72]:
sal['title_len'] = sal['JobTitle'].apply(len)

In [73]:
sal[['title_len','TotalPayBenefits']].corr()

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

Since the correlation is less than -0.03, it is a negative correlation. Furthermore, the value is close to zero which shows weak correlation.